# Tutorial 09 - Python Pandas Tutorial - Part 02

in this part we are going to learn about
1. stringIO
2. Pandas Read_csv

In [1]:
## reading different data sources with the help of pandas
from io import StringIO

In [2]:
import pandas as pd

In [27]:
df=pd.read_csv('Exhibitor lis - IEW 2024.csv')

In [37]:
df.head()

    ID   A1   A2   A3   A4   A5   A6   A7   A8   A9  A10  A11  A12 A13
0  DFG  DFG   15   16  OPL   19   15   30   15   16  OPL   19   15  30
1    2   31  ABC  DFG  ABC   20  DFG  ABC  DFG   17  ABC   20   16  31
2  DFG  DFG   17  OPL   20  ABC   17   32   17  OPL  DFG  ABC   17  32
3    4   33  ABC   19   21   22  OPL   33  OPL   19   21   22  DFG  33
4    5   34   19   20  DFG  DFG   19  DFG  DFG   20   22   23   19  34

In [38]:
type(df)

pandas.core.frame.DataFrame

In [45]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,d,3')

In [46]:
type(data)

str

In [50]:
# in memory file object
StringIO(data)

In [49]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [52]:
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [56]:
de = pd.read_csv('Exhibitor lis - IEW 2024.csv',usecols=['A1','A2','A3','A4','A5'])

In [60]:
de.tail()

      A1   A2   A3   A4   A5
389  DFG   30   25   33  DFG
390   40   31  DFG  ABC  HJO
391  DFG  ABC   31  HJO   36
392   48   27   32   36   37
393   49  DFG  DFG   37  DFG

In [61]:
de.head()

    A1   A2   A3   A4   A5
0  DFG   15   16  OPL   19
1   31  ABC  DFG  ABC   20
2  DFG   17  OPL   20  ABC
3   33  ABC   19   21   22
4   34   19   20  DFG  DFG

In [63]:
# convert this into csv only yht selected one

de.to_csv('test.csv')

In [64]:
#to remove indexing from table in csv
de.to_csv('test.csv', index=False)

In [66]:
## can we specify data types in csv

data=('a,b,c,d\n'
     '1,2,5,4\n'
     '7,8,9,5\n'
     '7,5,3')

In [68]:
dt= pd.read_csv(StringIO(data))

In [69]:
dt

   a  b  c    d
0  1  2  5  4.0
1  7  8  9  5.0
2  7  5  3  NaN

In [70]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [75]:
#we can also change dtype

dt= pd.read_csv(StringIO(data),dtype='object')

In [73]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [77]:
dt.head()

   a  b  c    d
0  1  2  5    4
1  7  8  9    5
2  7  5  3  NaN

In [78]:
dt.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [89]:
dt[['a','b']][1:3]

   a  b
1  7  8
2  7  5

In [96]:
# want to specify different data types

data=('a,b,c,d\n'
     '1,2,5,4\n'
     '7,8,9,5\n'
     '7,5,3,10')

In [97]:
dt= pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':object})

In [99]:
dt

   a    b  c   d
0  1  2.0  5   4
1  7  8.0  9   5
2  7  5.0  3  10

In [98]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      object
 3   d       3 non-null      int64
dtypes: float64(1), int32(1), int64(1), object(1)
memory usage: 216.0+ bytes

In [100]:
#another Example

data=('Index,b,c,d\n'
     '1,2,babu,4\n'
     '7,8,9.8,5\n'
     '7,hello,3,10')

In [101]:
dr =pd.read_csv(StringIO(data))

In [102]:
dr

   Index      b     c   d
0      1      2  babu   4
1      7      8   9.8   5
2      7  hello     3  10

In [104]:
dr =pd.read_csv(StringIO(data),index_col=0)

In [105]:
dr

           b     c   d
Index
1          2  babu   4
7          8   9.8   5
7      hello     3  10

In [118]:
#let us index cols and use cols

pd.read_csv(StringIO(data),usecols=['b','d'],index_col=0)

        d
b
2       4
8       5
hello  10

In [122]:
#tab Separated files
pd.read_csv('Exhibitor lis - IEW 2024.txt',sep='\t')

      ID   A1   A2   A3   A4   A5   A6   A7   A8   A9  A10  A11  A12  A13
0    DFG  DFG   15   16  OPL   19   15   30   15   16  OPL   19   15   30
1      2   31  ABC  DFG  ABC   20  DFG  ABC  DFG   17  ABC   20   16   31
2    DFG  DFG   17  OPL   20  ABC   17   32   17  OPL  DFG  ABC   17   32
3      4   33  ABC   19   21   22  OPL   33  OPL   19   21   22  DFG   33
4      5   34   19   20  DFG  DFG   19  DFG  DFG   20   22   23   19   34
..   ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
389  DFG  DFG   30   25   33  DFG   26  ABC   28   43  HJO   50   32   49
390   11   40   31  DFG  ABC  HJO  DFG   50  WER   44   36   51  ABC   50
391  ABC  DFG  ABC   31  HJO   36   32   51  DFG   45  ABC   52   36   51
392   17   48   27   32   36   37   33   52   31   46   46   53   37  ABC
393  OPL   49  DFG  DFG   37  DFG   34   53   32   47   47   54   38   55

[394 rows x 14 columns]

In [124]:
#also convert text file to csv

pd.read_csv('Exhibitor lis - IEW 2024.txt',sep='\t').to_csv('file012')